from fastapi import FastAPI, Request, Form #импорт классов для создания веб-приложения и работы с запросами
from fastapi.responses import HTMLResponse #импорт класса для отправки html-ответов
from fastapi.templating import Jinja2Templates #вставляет Python-код в HTML
from fastapi.staticfiles import StaticFiles #импорт функции для подключения css
from app.model import predict_iris, load_iris_model #импорт функций предсказания и загрузки модели из файла model.py

#создание экземпляра приложения FastAPI с заголовком в документации
app = FastAPI(title='Iris Classifier')
#подключение папки с html-шаблонами для отображения страниц
templates = Jinja2Templates(directory='app/templates')
#подключение папки со стилями
app.mount('/static', StaticFiles(directory='app/static'), name='static')

#декоратор - функция выполнится при запуске сервера
@app.on_event('startup') 
async def startup_event(): #асинхронная функция запуска при старте приложения
    load_iris_model() #вызов функции загрузки модели из файла model.py

#декоратор - функция обрабатывает get-запросы на главную страницу
@app.get('/')
async def home(request: Request): #асинхронная функция для отображения главной страницы
    return templates.TemplateResponse(  #возврат html-страницы из шаблона index.html
        'index.html', 
        {'request': request, 'result': None} #передача данных в шаблон: запрос и пустой результат
    )

#декоратор - функция обрабатывает post-запросы на адрес /predict
@app.post('/predict') 
async def predict( #асинхронная функция для обработки данных из формы
    request: Request,  #объект запроса от браузера
    sepal_length: float = Form(...),    #обязательные поля формы, параметр преобразуется в число
    sepal_width: float = Form(...),   
    petal_length: float = Form(...),  
    petal_width: float = Form(...)   
):
    #вызов функции предсказания из model.py с полученными параметрами
    species = predict_iris(sepal_length, sepal_width, petal_length, petal_width)
    #возврат html-страницы с результатом предсказания
    return templates.TemplateResponse(
        'index.html',
        {
            'request': request, #передача объекта запроса в шаблон
            'result': f'🌸 Вид ириса: {species}', #строка с результатом для отображения на странице
             #передача введенных значений обратно в форму (чтобы не исчезали)
            'sepal_length': sepal_length, 
            'sepal_width': sepal_width,
            'petal_length': petal_length,
            'petal_width': petal_width
        }
    )